Public Attributes | List of all members
API_UniformAttributeOptions Struct Reference
View Handling
General representation of a Model Display in 3D Document. More...
#include <APIdefs_Environment.h>
 Public Attributes
bool  | shouldUseUniformCutAttributes
Use uniform cut attributes.
short  | uniformLineType
Uniform line type index.
short  | uniformFillPen
Uniform fill index.
short  | uniformFillBkgPen
Background color of the uniform fill.
bool  | shouldUseUncutSurfaceFill
Use uncut surface fill.
API_3DCutSurfFills  | fillCutSurfacesWith
How to display the cut surfaces.
API_3DUncutSurfaceFillType  | uncutSurfaceFillType
How to display the uncut surfaces.
short  | uncutSurfaceBkgPen
Background color of the uncut surface.
bool  | shouldUseElemPen
Use elem pen.
short  | elemPen
Elem pen index.
short  | shadFillPen
Shadow fill pen.
API_AttributeIndex  | shadFill
Shadow fill index.
short  | shadFillBkgPen
Shadow fill background pen.
short  | shadContPen
Shadow contour pen.
API_3DHiddenEdgeVisibility  | hiddenEdgeVisibility
Show or hide hidden edges.
API_AttributeIndex  | hiddenEdgeLineType
Hidden edge line type.
short  | hiddenEdgeLinePen
Hidden edge line pen.
API_3DOnCutPlaneVisibility  | onCutPlaneVisibility
Show or hide hidden cut lines.
Detailed Description
General representation of a Model Display in 3D Document.
Remarks
You are able to get and change the default settings of 3D document via ACAPI_View_GetDocumentFrom3DDefaults and ACAPI_View_ChangeDocumentFrom3DDefaults functions. ACAPI_View_GetDocumentFrom3DSettings and ACAPI_View_ChangeDocumentFrom3DSettings function retrieves and modifies the settings of an existing 3D document database.
Member Data Documentation
◆ elemPen
 API_UniformAttributeOptions::elemPen
Elem pen index.
◆ fillCutSurfacesWith
 API_UniformAttributeOptions::fillCutSurfacesWith
How to display the cut surfaces.
◆ hiddenEdgeLinePen
 API_UniformAttributeOptions::hiddenEdgeLinePen
Hidden edge line pen.
◆ hiddenEdgeLineType
 API_UniformAttributeOptions::hiddenEdgeLineType
Hidden edge line type.
◆ hiddenEdgeVisibility
 API_UniformAttributeOptions::hiddenEdgeVisibility
Show or hide hidden edges.
◆ onCutPlaneVisibility
 API_UniformAttributeOptions::onCutPlaneVisibility
Show or hide hidden cut lines.
◆ shadContPen
 API_UniformAttributeOptions::shadContPen
Shadow contour pen.
◆ shadFill
 API_UniformAttributeOptions::shadFill
Shadow fill index.
◆ shadFillBkgPen
 API_UniformAttributeOptions::shadFillBkgPen
Shadow fill background pen.
◆ shadFillPen
 API_UniformAttributeOptions::shadFillPen
Shadow fill pen.
◆ shouldUseElemPen
 API_UniformAttributeOptions::shouldUseElemPen
Use elem pen.
◆ shouldUseUncutSurfaceFill
 API_UniformAttributeOptions::shouldUseUncutSurfaceFill
Use uncut surface fill.
◆ shouldUseUniformCutAttributes
 API_UniformAttributeOptions::shouldUseUniformCutAttributes
Use uniform cut attributes.
◆ uncutSurfaceBkgPen
 API_UniformAttributeOptions::uncutSurfaceBkgPen
Background color of the uncut surface.
◆ uncutSurfaceFillType
 API_UniformAttributeOptions::uncutSurfaceFillType
How to display the uncut surfaces.
◆ uniformFillBkgPen
 API_UniformAttributeOptions::uniformFillBkgPen
Background color of the uniform fill.
◆ uniformFillPen
 API_UniformAttributeOptions::uniformFillPen
Uniform fill index.
◆ uniformLineType
 API_UniformAttributeOptions::uniformLineType
Uniform line type index.